app/Controllers/Owner/Dashboard.php

SELECT `f`.`nama_cabang`, SUM(p.total) as total
FROM `penjualan` `p`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
GROUP BY `p`.`id_franchise`
ORDER BY `total` DESC
---
        }

        // 🔥 GRAFIK PER CABANG + RANKING
        $cabang = $db->table('penjualan p')
            ->select('f.nama_cabang, SUM(p.total) as total')
            ->join('franchise f', 'f.id_franchise = p.id_franchise')
            ->groupBy('p.id_franchise')
            ->orderBy('total', 'DESC')
            ->get()
            ->getResult();