app/Controllers/Owner/Dashboard.php

SELECT SUM(`total`) AS `total`
FROM `penjualan`
SELECT COUNT(*) AS `numrows`
FROM `franchise`
SELECT COUNT(*) AS `numrows`
FROM `penjualan`
SELECT DATE_FORMAT(tanggal, '%Y-%m') as bulan, SUM(total) as total
FROM `penjualan`
GROUP BY DATE_FORMAT(tanggal, '%Y-%m')
ORDER BY `bulan` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $omzet = $db->table('penjualan')
            ->selectSum('total')
            ->get()
            ->getRow();

        $totalOmset = $omzet ? ($omzet->total ?? 0) : 0;
        $bagiHasilPusat = $totalOmset * 0.2;
        $bagiHasilMitra = $totalOmset * 0.8;

        $totalCabang = $db->table('franchise')
            ->countAllResults();

        $totalTransaksi = $db->table('penjualan')
            ->countAllResults();

        $grafik = $db->table('penjualan')
            ->select("DATE_FORMAT(tanggal,'%Y-%m') as bulan, SUM(total) as total")
            ->groupBy("DATE_FORMAT(tanggal,'%Y-%m')")
            ->orderBy("bulan", "ASC")
            ->get()
            ->getResultArray();

SELECT `f`.`nama_cabang`, SUM(p.total) as total_penjualan
FROM `penjualan` `p`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
GROUP BY `p`.`id_franchise`
ORDER BY `total_penjualan` DESC
---
            $total[] = (int)$row['total'];
        }

        $cabang = $db->table('penjualan p')
            ->select('f.nama_cabang, SUM(p.total) as total_penjualan')
            ->join('franchise f', 'f.id_franchise = p.id_franchise')
            ->groupBy('p.id_franchise')
            ->orderBy('total_penjualan', 'DESC')
            ->get()
            ->getResultArray();