app/Controllers/Admin/Dashboard.php

            ->get()
            ->getResultArray();

        $data['cabang_terlaris'] = $db->table('penjualan')
            ->select('franchise.nama_cabang, SUM(penjualan.total) as total_penjualan')
            ->join('franchise','franchise.id_franchise = penjualan.id_franchise','left')
            ->groupBy('penjualan.id_franchise')
            ->orderBy('total_penjualan','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `franchise`.`nama_cabang`, SUM(penjualan.total) as total_penjualan
FROM `penjualan`
LEFT JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
GROUP BY `penjualan`.`id_franchise`
ORDER BY `total_penjualan` DESC
 LIMIT 5