app/Controllers/Admin/Dashboard.php

            ->getResultArray();

        // transaksi terbaru
        $data['transaksi_terbaru'] = $db->table('penjualan')
            ->select('penjualan.id_penjualan, penjualan.tanggal, penjualan.total, franchise.nama_cabang, produk_jamu.nama_produk')
            ->join('franchise','franchise.id_franchise = penjualan.id_franchise')
            ->join('produk_jamu','produk_jamu.id_produk = penjualan.id_produk')
            ->orderBy('penjualan.id_penjualan','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        // produk terlaris
        $data['produk_terlaris'] = $db->table('penjualan')
            ->select('produk_jamu.nama_produk, SUM(penjualan.jumlah) as total_jual')
            ->join('produk_jamu','produk_jamu.id_produk = penjualan.id_produk')
            ->groupBy('produk_jamu.id_produk')
            ->orderBy('total_jual','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        // cabang terlaris
        $data['cabang_terlaris'] = $db->table('penjualan')
            ->select('franchise.nama_cabang, SUM(penjualan.total) as total_penjualan')
            ->join('franchise','franchise.id_franchise = penjualan.id_franchise')
            ->groupBy('franchise.id_franchise')
            ->orderBy('total_penjualan','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `penjualan`.`id_penjualan`, `penjualan`.`tanggal`, `penjualan`.`total`, `franchise`.`nama_cabang`, `produk_jamu`.`nama_produk`
FROM `penjualan`
JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
ORDER BY `penjualan`.`id_penjualan` DESC
 LIMIT 5
SELECT `produk_jamu`.`nama_produk`, SUM(penjualan.jumlah) as total_jual
FROM `penjualan`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
GROUP BY `produk_jamu`.`id_produk`
ORDER BY `total_jual` DESC
 LIMIT 5
SELECT `franchise`.`nama_cabang`, SUM(penjualan.total) as total_penjualan
FROM `penjualan`
JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
GROUP BY `franchise`.`id_franchise`
ORDER BY `total_penjualan` DESC
 LIMIT 5