app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `franchise`
SELECT COUNT(*) AS `numrows`
FROM `produk_jamu`
SELECT COUNT(*) AS `numrows`
FROM `penjualan`
SELECT *
FROM `penjualan`
SELECT SUM(`total`) AS `total`
FROM `penjualan`
SELECT DATE(tanggal) as tanggal, SUM(total) as total
FROM `penjualan`
GROUP BY DATE(tanggal)
ORDER BY `tanggal` ASC
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        /* =========================
           TOTAL DATA
        ========================== */

        $data['total_franchise'] = $db->table('franchise')->countAllResults();
        $data['total_produk']    = $db->table('produk_jamu')->countAllResults();
        $data['total_transaksi'] = $db->table('penjualan')->countAllResults();

        $omzet = $db->table('penjualan')
            ->selectSum('total')
            ->get()
            ->getRow();

        $data['total_omzet'] = $omzet->total ?? 0;

        /* =========================
           GRAFIK PENJUALAN
        ========================== */

        $penjualan = $db->table('penjualan')
            ->select('DATE(tanggal) as tanggal, SUM(total) as total')
            ->groupBy('DATE(tanggal)')
            ->orderBy('tanggal','ASC')
            ->get()
            ->getResultArray();

SELECT `produk_jamu`.`nama_produk`, SUM(detail_penjualan.qty) as total_jual
FROM `detail_penjualan`
LEFT JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `detail_penjualan`.`id_produk`
GROUP BY `detail_penjualan`.`id_produk`
SELECT `produk_jamu`.`nama_produk`, SUM(penjualan.jumlah) as total_jual
FROM `penjualan`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
GROUP BY `produk_jamu`.`id_produk`
---
           PIE CHART PRODUK (AMAN)
        ========================== */

        $produk = $db->table('detail_penjualan')
            ->select('produk_jamu.nama_produk, SUM(detail_penjualan.qty) as total_jual')
            ->join('produk_jamu','produk_jamu.id_produk = detail_penjualan.id_produk','left')
            ->groupBy('detail_penjualan.id_produk')
            ->get()
            ->getResultArray();

SELECT `penjualan`.`id_penjualan`, `penjualan`.`tanggal`, `penjualan`.`total`, `franchise`.`nama_cabang`
FROM `penjualan`
LEFT JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
ORDER BY `penjualan`.`id_penjualan` DESC
 LIMIT 5
---
           TRANSAKSI TERBARU (FIX)
        ========================== */

        $data['transaksi_terbaru'] = $db->table('penjualan')
            ->select('penjualan.id_penjualan, penjualan.tanggal, penjualan.total, franchise.nama_cabang')
            ->join('franchise','franchise.id_franchise = penjualan.id_franchise','left')
            ->orderBy('penjualan.id_penjualan','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT `produk_jamu`.`nama_produk`, SUM(penjualan.jumlah) as total_jual
FROM `penjualan`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
GROUP BY `produk_jamu`.`id_produk`
ORDER BY `total_jual` DESC
 LIMIT 5
SELECT `produk_jamu`.`nama_produk`, SUM(detail_penjualan.qty) as total_jual
FROM `detail_penjualan`
LEFT JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `detail_penjualan`.`id_produk`
GROUP BY `detail_penjualan`.`id_produk`
ORDER BY `total_jual` DESC
 LIMIT 5
---
           PRODUK TERLARIS (LIST)
        ========================== */

        $data['produk_terlaris'] = $db->table('detail_penjualan')
            ->select('produk_jamu.nama_produk, SUM(detail_penjualan.qty) as total_jual')
            ->join('produk_jamu','produk_jamu.id_produk = detail_penjualan.id_produk','left')
            ->groupBy('detail_penjualan.id_produk')
            ->orderBy('total_jual','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT `franchise`.`nama_cabang`, SUM(penjualan.total) as total_penjualan
FROM `penjualan`
LEFT JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
GROUP BY `penjualan`.`id_franchise`
ORDER BY `total_penjualan` DESC
 LIMIT 5
---
           CABANG TERLARIS
        ========================== */

        $data['cabang_terlaris'] = $db->table('penjualan')
            ->select('franchise.nama_cabang, SUM(penjualan.total) as total_penjualan')
            ->join('franchise','franchise.id_franchise = penjualan.id_franchise','left')
            ->groupBy('penjualan.id_franchise')
            ->orderBy('total_penjualan','DESC')
            ->limit(5)
            ->get()
            ->getResultArray();