app/Controllers/Admin/Franchise.php

SELECT *
FROM `franchise`
---
    public function index()
    {
        $model = new FranchiseModel();

        $data['franchise'] = $model->findAll();