app/Controllers/Admin/User.php

SELECT `u`.*, `f`.`nama_cabang`, `f`.`pemilik`
FROM `user` `u`
LEFT JOIN `franchise` `f` ON `f`.`id_franchise` = `u`.`id_franchise`
WHERE `u`.`role` = 'mitra'
ORDER BY `u`.`id_user` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['users'] = $db->table('user u')
            ->select('u.*, f.nama_cabang, f.pemilik')
            ->join('franchise f', 'f.id_franchise = u.id_franchise', 'left')
            ->where('u.role', 'mitra')
            ->orderBy('u.id_user', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `franchise`
---
    public function tambah()
    {
        $db = \Config\Database::connect();

        $data['franchise'] = $db->table('franchise')->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `username` = 'pagaden'
INSERT INTO `user` (`username`, `password`, `role`, `id_franchise`) VALUES ('pagaden', '$2y$10$ihmPzTdj6GJ2FaElGfZHb.y/1BaCdlog16G7e5Xl2g8i3jl5L9FzG', 'mitra', '6')
---
    public function simpan()
    {
        $db = \Config\Database::connect();

        $data = [
            'username'     => $this->request->getPost('username'),
            'password'     => $this->request->getPost('password'),
            'role'         => 'mitra',
            'id_franchise' => $this->request->getPost('id_franchise')
        ];

        $cek = $db->table('user')->where('username', $data['username'])->countAllResults();
        if ($cek > 0) {
            return redirect()->back()->withInput()->with('error', 'Username sudah digunakan');
        }

        $db->table('user')->insert($data);