app/Controllers/mitra.php

SELECT *
FROM `franchise`
WHERE `id_franchise` = '3'
SELECT *
FROM `penjualan`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
WHERE `penjualan`.`id_franchise` = '3'
ORDER BY `penjualan`.`tanggal` DESC
SELECT COUNT(*) AS `numrows`
FROM `penjualan`
WHERE `id_franchise` = '3'
SELECT SUM(`total`) AS `total`
FROM `penjualan`
WHERE `id_franchise` = '3'
---
    public function index()
    {

        if(!session()->get('logged_in')){
            return redirect()->to('/login');
        }

        if(session()->get('role') != 'mitra'){
            return redirect()->to('/dashboard');
        }

        $db = \Config\Database::connect();
        $id_franchise = session()->get('id_franchise');

        // data cabang
        $data['cabang'] = $db->table('franchise')
            ->where('id_franchise',$id_franchise)
            ->get()
            ->getRowArray();

        // penjualan
        $data['penjualan'] = $db->table('penjualan')
            ->join('produk_jamu','produk_jamu.id_produk = penjualan.id_produk')
            ->where('penjualan.id_franchise',$id_franchise)
            ->orderBy('penjualan.tanggal','DESC')
            ->get()
            ->getResultArray();

        // total transaksi
        $data['total_transaksi'] = $db->table('penjualan')
            ->where('id_franchise',$id_franchise)
            ->countAllResults();

        // total omzet
        $omzet = $db->table('penjualan')
            ->selectSum('total')
            ->where('id_franchise',$id_franchise)
            ->get()
            ->getRow();