app/Controllers/Penjualan.php

SELECT `penjualan`.*, `produk_jamu`.`nama_produk`, `franchise`.`nama_cabang`
FROM `penjualan`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `penjualan`.`id_produk`
JOIN `franchise` ON `franchise`.`id_franchise` = `penjualan`.`id_franchise`
WHERE `penjualan`.`id_franchise` = 3
ORDER BY `penjualan`.`tanggal` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $role = session()->get('role');
        $id_franchise = (int) session()->get('id_franchise');

        $builder = $db->table('penjualan')
            ->join('produk_jamu', 'produk_jamu.id_produk = penjualan.id_produk')
            ->join('franchise', 'franchise.id_franchise = penjualan.id_franchise')
            ->select('penjualan.*, produk_jamu.nama_produk, franchise.nama_cabang');

        // mitra hanya melihat cabangnya sendiri
        if ($role == 'mitra') {
            $builder->where('penjualan.id_franchise', $id_franchise);
        }

        $data['penjualan'] = $builder
            ->orderBy('penjualan.tanggal', 'DESC')
            ->get()
            ->getResultArray();