app/Controllers/Penjualan.php

            ->get()
            ->getResultArray();

        $data['listCabang'] = $db->table('franchise')->get()->getResultArray();
---
SELECT *
FROM `franchise`

    public function laporan()
    {
        $db = \Config\Database::connect();

        $cabang = $this->request->getGet('cabang');

        $limit = 10;
        $page  = (int) ($this->request->getGet('page_laporan') ?? 1);
        $offset = ($page - 1) * $limit;

        $builder = $db->table('penjualan p')
            ->select('p.id_penjualan, p.tanggal, p.total, f.nama_cabang')
            ->join('franchise f', 'f.id_franchise = p.id_franchise');

        if ($cabang) {
            $builder->where('p.id_franchise', $cabang);
        }

        $totalData = $builder->countAllResults(false);

        $data['penjualan'] = $builder
            ->orderBy('p.tanggal', 'DESC')
            ->limit($limit, $offset)
            ->get()
            ->getResultArray();

        $data['listCabang'] = $db->table('franchise')->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `penjualan` `p`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
SELECT *
FROM `franchise`
SELECT `p`.`id_penjualan`, `p`.`tanggal`, `p`.`total`, `f`.`nama_cabang`
FROM `penjualan` `p`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
ORDER BY `p`.`tanggal` DESC
 LIMIT 10