app/Controllers/Stok.php

SELECT `stok`.*, `produk_jamu`.`nama_produk`, `franchise`.`nama_cabang`
FROM `stok`
JOIN `produk_jamu` ON `produk_jamu`.`id_produk` = `stok`.`id_produk`
JOIN `franchise` ON `franchise`.`id_franchise` = `stok`.`id_franchise`
---
public function index()
{

$db = \Config\Database::connect();

$data['stok'] = $db->table('stok')
->select('stok.*, produk_jamu.nama_produk, franchise.nama_cabang')
->join('produk_jamu','produk_jamu.id_produk = stok.id_produk')
->join('franchise','franchise.id_franchise = stok.id_franchise')
->get()
->getResultArray();