app/Controllers/Mitra/Pemesanan.php

SELECT `p`.*, `b`.`nama_bahan`, `f`.`nama_cabang`
FROM `pemesanan_bahan` `p`
JOIN `bahan_baku` `b` ON `b`.`id_bahan` = `p`.`id_bahan`
JOIN `franchise` `f` ON `f`.`id_franchise` = `p`.`id_franchise`
WHERE `p`.`id_franchise` = '3'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['pesanan'] = $db->table('pemesanan_bahan p')
            ->select('p.*, b.nama_bahan, f.nama_cabang') // 🔥 WAJIB ADA
            ->join('bahan_baku b', 'b.id_bahan = p.id_bahan')
            ->join('franchise f', 'f.id_franchise = p.id_franchise')
            ->where('p.id_franchise', session()->get('id_franchise'))
            ->get()
            ->getResultArray();

SELECT *
FROM `bahan_baku`
---
    public function tambah()
    {
        $db = \Config\Database::connect();

        $data['bahan'] = $db->table('bahan_baku')->get()->getResultArray();